# NewSpaceSet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
Application..::..NewSpaceSet Method
Application Class See Also
---
Creates a new instance of a space set.
**Namespace:** Autodesk.Revit.Creation**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public SpaceSet NewSpaceSet()
```

Visual Basic
---
```text
Public Function NewSpaceSet As SpaceSet
```

Visual C++
---
```text
public:
SpaceSet^ NewSpaceSet()
```

# See Also
Application Class
Autodesk.Revit.Creation Namespace